app/controllers/certifications_controller.rb

  def create
    #@certification = Certification.new(params[:certification])
    @certification.resume_id=session[:resume_id]
    @person=PersonalDatum.find_last_by_user_id(current_user.id)
    @language = Language.new
    @privacy = Privacy.new

    respond_to do |format|
      if @certification.save
---
INSERT INTO `certifications` (`certification_name`, `certification_year`, `created_at`, `resume_id`, `updated_at`) VALUES ('certi1', NULL, '2012-12-05 12:37:00', 3, '2012-12-05 12:37:00')

  def destroy
    #@certification = Certification.find(params[:id])
    @certification.destroy
---
DELETE FROM `certifications` WHERE `certifications`.`id` = 1