app/controllers/educations_controller.rb

INSERT INTO `educations` (`country`, `course`, `created_at`, `end_date`, `level`, `resume_id`, `school_name`, `school_type`, `start_date`, `state`, `updated_at`) VALUES ('india', 'B.Sc', '2012-12-05 11:42:26', NULL, 'graduation', 3, 'sree', 'goverment', NULL, 'kerala', '2012-12-05 11:42:26')
---
  def create
    #@education = Education.new(params[:education])
    @education.resume_id=session[:resume_id]

    respond_to do |format|
      if @education.save

DELETE FROM `educations` WHERE `educations`.`id` = 4
---
  def destroy
    #@education = Education.find(params[:id])
    @education.destroy