app/controllers/employment_histories_controller.rb

  def create
    #@employment_history = EmploymentHistory.new(params[:employment_history])
    @person=PersonalDatum.find_last_by_user_id(current_user.id)
    @employment_history.resume_id=session[:resume_id]

    respond_to do |format|
      if @employment_history.save
---
INSERT INTO `employment_histories` (`company_name`, `created_at`, `end_date`, `job_description`, `job_title`, `resume_id`, `start_date`, `updated_at`) VALUES ('klairvoyant', '2012-12-05 11:29:34', NULL, 'developer', 'Developer', 3, NULL, '2012-12-05 11:29:34')

  def destroy
    #@employment_history = EmploymentHistory.find(params[:id])
    @employment_history.destroy
---
DELETE FROM `employment_histories` WHERE `employment_histories`.`id` = 7