app/controllers/languages_controller.rb

  def create
    #@language = Language.new(params[:language])
    @language.resume_id=session[:resume_id]
    @person=PersonalDatum.find_last_by_user_id(current_user.id)
    @certification = Certification.new
    @privacy = Privacy.new

    respond_to do |format|
      if @language.save
---
INSERT INTO `languages` (`created_at`, `language_name`, `language_proficiency`, `resume_id`, `updated_at`) VALUES ('2012-12-05 12:24:44', 'java', 'good', 3, '2012-12-05 12:24:44')

  def destroy
    #@language = Language.find(params[:id])
    @language.destroy
---
DELETE FROM `languages` WHERE `languages`.`id` = 9