app/controllers/objectives_controller.rb

INSERT INTO `objectives` (`created_at`, `interest_area_id`, `job_type_id`, `objective`, `resume_id`, `salary_range_id`, `updated_at`) VALUES ('2012-12-05 11:12:56', '2', '2', 'better career', 3, '1', '2012-12-05 11:12:56')
---
  def create
    @objective = Objective.new(params[:objective])
    @person=PersonalDatum.find_last_by_user_id(current_user.id)
    @objective.resume_id=session[:resume_id]
    respond_to do |format|
      if @objective.save

SELECT `objectives`.* FROM `objectives` WHERE `objectives`.`id` = 12 LIMIT 1
DELETE FROM `objectives` WHERE `objectives`.`id` = 12
---
  def destroy
    @objective = Objective.find(params[:id])
    @objective.destroy