app/controllers/personal_data_controller.rb

  def index

    if current_user.role==2
      redirect_to dashboard_for_alumni_index_path and return
    elsif current_user.role==3
      redirect_to dash_board_for_hr_index_path  and return
    elsif current_user.role==4
      redirect_to dash_board_for_recruiter_index_path  and return
    else
        @personal_datum=PersonalDatum.find_last_by_user_id(current_user.id)
        @resume=Resume.find_all_by_option_no_and_user_id(3,current_user.id)  #3 =uploaded file
        @file_uploads = FileUpload.find_all_by_user_id(current_user.id)
        @file_upload = FileUpload.new
        if @personal_datum.nil?
        else
              @personal_datum.register==true  # to check whether it's first time or not
              @confirmed= Interview.where("user_id= ?  and interview_type= ? ",current_user.id,1)
---
SELECT `resumes`.* FROM `resumes` WHERE `resumes`.`option_no` = 3 AND `resumes`.`user_id` = 7
SELECT `interviews`.* FROM `interviews` WHERE (user_id= 7 and interview_type= 1 )