app/controllers/personal_data_controller.rb

  def index

    @file_uploads = FileUpload.all
---
SELECT `file_uploads`.* FROM `file_uploads`