app/controllers/privacies_controller.rb

  def create
    @person=PersonalDatum.find_last_by_user_id(current_user.id)
    @privacy.save
---
INSERT INTO `privacies` (`created_at`, `privacy`, `resume_id`, `updated_at`, `user_id`) VALUES ('2012-12-05 12:49:48', NULL, 3, '2012-12-05 12:49:48', 7)

  def destroy
    @privacy.destroy
---
DELETE FROM `privacies` WHERE `privacies`.`id` = 10