app/controllers/resumes_controller.rb

  def create
    #@resume = Resume.new(params[:resume])

    session[:user_id]=current_user.id
    @resume.user_id=current_user.id


     if @resume.file_name.blank?
       @resume.resume_type=0
     else
       @resume.resume_type=1
       @resume.option_no=3
     end

    if @resume.data.blank?

    else
      @resume.resume_type=0
      @resume.option_no=4
    end



    respond_to do |format|
      if @resume.save
---
INSERT INTO `resumes` (`created_at`, `data`, `file_name`, `option_no`, `resume_type`, `updated_at`, `user_id`) VALUES ('2012-12-04 10:37:01', NULL, NULL, 3, 0, '2012-12-04 10:37:01', 2)

  def destroy
    #@resume = Resume.find(params[:id])
    @resume.destroy
---
DELETE FROM `resumes` WHERE `resumes`.`id` = 84