app/controllers/search_preferences_controller.rb

SELECT `search_preferences`.* FROM `search_preferences` WHERE `search_preferences`.`id` = 1 LIMIT 1
---
  def edit
    @search_preference = SearchPreference.find(params[:id])

INSERT INTO `search_preferences` (`category_id`, `city`, `created_at`, `state`, `updated_at`, `user_id`, `zipcode`) VALUES (4, 'Thrissur', '2012-12-05 13:11:59', 'kerala', '2012-12-05 13:11:59', 3, '456789')
---
  def create
    @search_preference = SearchPreference.new(params[:search_preference])

    respond_to do |format|
      if @search_preference.save

SELECT `search_preferences`.* FROM `search_preferences` WHERE `search_preferences`.`id` = 7 LIMIT 1
---
  def update
    @search_preference = SearchPreference.find(params[:id])

SELECT `search_preferences`.* FROM `search_preferences` WHERE `search_preferences`.`id` = 2 LIMIT 1
DELETE FROM `search_preferences` WHERE `search_preferences`.`id` = 2
---
  def destroy
    @search_preference = SearchPreference.find(params[:id])
    @search_preference.destroy