app/controllers/skills_controller.rb

  def create
    @skill.resume_id=session[:resume_id]
    @person=PersonalDatum.find_last_by_user_id(current_user.id)
    @education = Education.new
    respond_to do |format|
      if @skill.save
---
INSERT INTO `skills` (`created_at`, `resume_id`, `skill_name`, `skill_years`, `updated_at`) VALUES ('2012-12-05 12:09:09', 3, 'C++', 4, '2012-12-05 12:09:09')

  def destroy
     @skill.destroy
---
DELETE FROM `skills` WHERE `skills`.`id` = 2