app/controllers/time_zones_controller.rb

SELECT `time_zones`.* FROM `time_zones` WHERE `time_zones`.`id` = 10 LIMIT 1
---
  def edit
    @time_zone = TimeZone.find(params[:id])

INSERT INTO `time_zones` (`created_at`, `time_zone`, `updated_at`, `user_id`) VALUES ('2012-12-05 16:08:40', '5:30', '2012-12-05 16:08:40', 4)
---
  def create
    @time_zone = TimeZone.new(params[:time_zone])

    respond_to do |format|
      if @time_zone.save

SELECT `time_zones`.* FROM `time_zones` WHERE `time_zones`.`id` = 3 LIMIT 1
---
  def update
    @time_zone = TimeZone.find(params[:id])

SELECT `time_zones`.* FROM `time_zones` WHERE `time_zones`.`id` = 1 LIMIT 1
DELETE FROM `time_zones` WHERE `time_zones`.`id` = 1
---
  def destroy
    @time_zone = TimeZone.find(params[:id])
    @time_zone.destroy